docs/tmpRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:tns="urn:platform_2017_2.webservices.netsuite.com"
               xmlns:platformMsgs="urn:messages_2017_2.platform.webservices.netsuite.com"
               xmlns:platformFaults="urn:faults_2017_2.platform.webservices.netsuite.com"
               xmlns:platformCore="urn:core_2017_2.platform.webservices.netsuite.com"
               xmlns:platformCommon="urn:common_2017_2.platform.webservices.netsuite.com"
               xmlns:listRel="urn:relationships_2017_2.lists.webservices.netsuite.com"
               xmlns:tranSales="urn:sales_2017_2.transactions.webservices.netsuite.com"
               xmlns:actSched="urn:scheduling_2017_2.activities.webservices.netsuite.com"
               xmlns:setupCustom="urn:customization_2017_2.setup.webservices.netsuite.com"
               xmlns:listAcct="urn:accounting_2017_2.lists.webservices.netsuite.com"
               xmlns:tranBank="urn:bank_2017_2.transactions.webservices.netsuite.com"
               xmlns:tranCust="urn:customers_2017_2.transactions.webservices.netsuite.com"
               xmlns:tranInvt="urn:inventory_2017_2.transactions.webservices.netsuite.com"
               xmlns:listSupport="urn:support_2017_2.lists.webservices.netsuite.com"
               xmlns:tranGeneral="urn:general_2017_2.transactions.webservices.netsuite.com"
               xmlns:listMkt="urn:marketing_2017_2.lists.webservices.netsuite.com"
               xmlns:listWebsite="urn:website_2017_2.lists.webservices.netsuite.com"
               xmlns:fileCabinet="urn:filecabinet_2017_2.documents.webservices.netsuite.com"
               xmlns:listEmp="urn:employees_2017_2.lists.webservices.netsuite.com">
  <soap:Header>
    <platformMsgs:passport>
      <platformCore:email>alexandr@buildateam.io</platformCore:email>
      <platformCore:password>PPP3001117</platformCore:password>
      <platformCore:account>3946319</platformCore:account>
      <platformCore:role internalId="3"></platformCore:role>
    </platformMsgs:passport>
    <platformMsgs:applicationInfo>
      <platformCore:applicationId>7BCC32F1-FBA5-4796-A6C4-D443AEBCD47C</platformCore:applicationId>
    </platformMsgs:applicationInfo>
  </soap:Header>
  <soap:Body>
    <platformMsgs:add xmlns:platformMsgs="urn:messages_2017_2.platform.webservices.netsuite.com"
                      xmlns="urn:messages_2017_2.platform.webservices.netsuite.com">
      <platformMsgs:SalesOrder xsi:type="tranSalesSalesOrder:SalesOrder"
                               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                               xmlns:tranSalesSalesOrder="urn:sales_2017_2.transactions.webservices.netsuite.com">
        <tranSalesSalesOrder:entity xsi:type="platformCore:RecordRef"
                                    internalId="2645793"></tranSalesSalesOrder:entity>
        <tranSalesSalesOrder:orderStatus>_pendingFulfillment</tranSalesSalesOrder:orderStatus>
        <tranSalesSalesOrder:toBeEmailed>true</tranSalesSalesOrder:toBeEmailed>
        <tranSalesSalesOrder:email>test@zzp.com</tranSalesSalesOrder:email>
        <tranSalesSalesOrder:billingAddress xsi:type="platformCommonAddress:Address"
                                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                            xmlns:platformCommonAddress="urn:common_2017_2.platform.webservices.netsuite.com">
          <platformCommonAddress:addr1>addr1</platformCommonAddress:addr1>
          <platformCommonAddress:addr2>addr2</platformCommonAddress:addr2>
          <platformCommonAddress:addressee>addressee</platformCommonAddress:addressee>
          <platformCommonAddress:addrPhone>addrPhone</platformCommonAddress:addrPhone>
          <platformCommonAddress:attention>attention</platformCommonAddress:attention>
          <platformCommonAddress:city>city</platformCommonAddress:city>
          <platformCommonAddress:country>_unitedStates</platformCommonAddress:country>
          <platformCommonAddress:override>false</platformCommonAddress:override>
          <platformCommonAddress:state>state</platformCommonAddress:state>
          <platformCommonAddress:zip>000000</platformCommonAddress:zip>
        </tranSalesSalesOrder:billingAddress>
        <tranSalesSalesOrder:shippingAddress xsi:type="platformCommonAddress:Address"
                                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                             xmlns:platformCommonAddress="urn:common_2017_2.platform.webservices.netsuite.com">
          <platformCommonAddress:addr1>addr1</platformCommonAddress:addr1>
          <platformCommonAddress:addr2>addr2</platformCommonAddress:addr2>
          <platformCommonAddress:addressee>addressee</platformCommonAddress:addressee>
          <platformCommonAddress:addrPhone>addrPhone</platformCommonAddress:addrPhone>
          <platformCommonAddress:attention>attention</platformCommonAddress:attention>
          <platformCommonAddress:city>city</platformCommonAddress:city>
          <platformCommonAddress:country>_unitedStates</platformCommonAddress:country>
          <platformCommonAddress:override>false</platformCommonAddress:override>
          <platformCommonAddress:state>state</platformCommonAddress:state>
          <platformCommonAddress:zip>000000</platformCommonAddress:zip>
        </tranSalesSalesOrder:shippingAddress>
        <tranSalesSalesOrder:shipMethod xsi:type="platformCore:RecordRef"
                                        internalId="6921"></tranSalesSalesOrder:shipMethod>
        <tranSalesSalesOrder:shippingCost>150</tranSalesSalesOrder:shippingCost>
        <tranSalesSalesOrder:getAuth>true</tranSalesSalesOrder:getAuth>
        <tranSalesSalesOrder:itemList xsi:type="tranSalesSalesOrderItemList:SalesOrderItemList"
                                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                      xmlns:tranSalesSalesOrderItemList="urn:sales_2017_2.transactions.webservices.netsuite.com"
                                      replaceAll="true">
          <tranSalesSalesOrderItemList:item xsi:type="tranSalesSalesOrderItem:SalesOrderItem"
                                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                            xmlns:tranSalesSalesOrderItem="urn:sales_2017_2.transactions.webservices.netsuite.com">
            <tranSalesSalesOrderItem:item xsi:type="platformCore:RecordRef"
                                          internalId="6167"></tranSalesSalesOrderItem:item>
            <tranSalesSalesOrderItem:quantity>1</tranSalesSalesOrderItem:quantity>
          </tranSalesSalesOrderItemList:item>
          <tranSalesSalesOrderItemList:item xsi:type="tranSalesSalesOrderItem:SalesOrderItem"
                                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                            xmlns:tranSalesSalesOrderItem="urn:sales_2017_2.transactions.webservices.netsuite.com">
            <tranSalesSalesOrderItem:item xsi:type="platformCore:RecordRef"
                                          internalId="4459"></tranSalesSalesOrderItem:item>
            <tranSalesSalesOrderItem:quantity>1</tranSalesSalesOrderItem:quantity>
          </tranSalesSalesOrderItemList:item>
          <tranSalesSalesOrderItemList:item xsi:type="tranSalesSalesOrderItem:SalesOrderItem"
                                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                            xmlns:tranSalesSalesOrderItem="urn:sales_2017_2.transactions.webservices.netsuite.com">
            <tranSalesSalesOrderItem:item xsi:type="platformCore:RecordRef"
                                          internalId="4183"></tranSalesSalesOrderItem:item>
            <tranSalesSalesOrderItem:quantity>1</tranSalesSalesOrderItem:quantity>
          </tranSalesSalesOrderItemList:item>
        </tranSalesSalesOrder:itemList>
      </platformMsgs:SalesOrder>
    </platformMsgs:add>
  </soap:Body>
</soap:Envelope>
// Invalid item reference key 4183.
